var isOpen = false;
var number = 4;
var number2= 6;

if(number!=number2){
alert("مفتوح");
}


if ( الشرط ) {
    // الأمر الذي يتم تنفيذه في حالة تحقق الشرط
  }


  
//      إستخدامه     الرمز	
//      >	        علامة أكبر من
//      <	        علامة أصغر من
//      >=	        علامة أكبر من أو يساوي
//      <=	        علامة أصغر من أو يساوي
//      ==	        القيمتين متساويتين بغض النظر 
//                  عن نوع البيانات أي أن القيمة 1 تساوي القيمة '1'
//      !=	        القيمتين غير متساويتين
//      ===     	القيمتين متساويتين ومن نفس نوع البيانات أي أن القيمة 1 لا تساوي القيمة '1'
//      !==     	القيمتين غير متساويتين مع الأخذ في الإعتبار نوع البيانات